# SQL II: Grouping and Joining

_May 18, 2020_

Agenda:
- Practice with Grouping in SQLite
- Practice with different types of Joins in SQLite

<img src = "https://media.giphy.com/media/3oKIPnAiaMCws8nOsE/giphy.gif">

In [1]:
import sqlite3
import pandas as pd
import seaborn as sns
import numpy as np

## Part I. Grouping
Just like pandas, Sql support different types of grouping statements for performing aggregate functions and allow us to calculate various statistics for data.

Syntax:
`SELECT * FROM tables GROUP BY column`

In [2]:
# instantiate some data
auto = pd.read_csv('auto-mpg.csv')
tips = sns.load_dataset('tips')
small_quiz = pd.DataFrame({"students":["Muriel","JP","Danny"],
                          "projects":[1,2,1],
                          "grades":np.random.randint(80,100,3)})
small_grades = pd.DataFrame({"students":["Kevin","JP","Dipta"],
                            "quiz_score":np.random.randint(0,10,3)})

In [3]:
conn = sqlite3.connect('aggregate.db')
c = conn.cursor()

In [4]:
# insert these datasets into our db
auto.to_sql('auto', con=conn)
tips.to_sql('tips', con=conn)
small_grades.to_sql('small_grade', con=conn)
small_quiz.to_sql('small_quiz',con=conn)

/Users/kevinevans/opt/anaconda3/envs/learn-env/lib/python3.6/site-packages/pandas/core/generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [12]:
# for the tips df/table, get the total number of man and woman who tips
tips.groupby('sex').sex.value_counts()
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [24]:
# in sql 
query = """SELECT time, sex, COUNT(sex), AVG(tip) FROM tips GROUP BY time, sex"""
c.execute(query).fetchall()

[('Dinner', 'Female', 52, 3.0021153846153843),
 ('Dinner', 'Male', 124, 3.1448387096774195),
 ('Lunch', 'Female', 35, 2.5828571428571436),
 ('Lunch', 'Male', 33, 2.8821212121212123)]

In [11]:
# using pandas, select the average amount tipped for time
tips.groupby('time').tip.mean()

time
Lunch     2.728088
Dinner    3.102670
Name: tip, dtype: float64

In [17]:
# use sql to recreate this query
query = """SELECT time, AVG(tip) FROM tips GROUP BY time ORDER BY AVG(tip)"""
c.execute(query).fetchall()

[('Lunch', 2.7280882352941176), ('Dinner', 3.102670454545454)]

We can also use `GROUP BY` with certain conditions, in conjunction with filtering and ordering.

In [25]:
# use pandas, get the average total bills for a party larger than 2 for every size of party
tips.groupby(['size']).total_bill.mean()[2:]

size
3    23.277632
4    28.613514
5    30.068000
6    34.830000
Name: total_bill, dtype: float64

In [35]:
# use sql to recreate this query
query = """SELECT size, AVG(total_bill) FROM tips GROUP BY size HAVING size > 2"""
c.execute(query).fetchall()

[(3, 23.27763157894737), (4, 28.61351351351351), (5, 30.068), (6, 34.83)]

In [27]:
# your turn - use pandas, get the maximum value of total bill for female non smoker
tips[(tips.sex == 'Female') & (tips.smoker == 'No')].total_bill.max()

35.83

In [31]:
# use sql to recreate this query
query = """SELECT MAX(total_bill) FROM tips WHERE sex = 'Female' and smoker = 'No' GROUP BY sex, smoker"""
c.execute(query).fetchall()

[(35.83,)]

In [42]:
# your turn - use pandas, get the average tip values for different size groups, and show top 2
# most amount of average tips
tips.groupby(['size']).total_bill.mean().sort_values(ascending=False).head(2)

size
6    34.830
5    30.068
Name: total_bill, dtype: float64

In [53]:
# use sql 
query = """SELECT size, AVG(total_bill) FROM tips GROUP BY size ORDER BY AVG(total_bill) DESC LIMIT 2"""
c.execute(query).fetchall()

[(6, 34.83), (5, 30.068)]

## Part II. Join

Based on this diagram, how would you explain the different types of joins?

<img src = 'sql-joins.png' width = 400>

In [55]:
print(small_grades)
print(small_quiz)

  students  quiz_score
0    Kevin           4
1       JP           2
2    Dipta           1
  students  projects  grades
0   Muriel         1      83
1       JP         2      85
2    Danny         1      85

In [ ]:
# left join - join small quiz with small grades, on student name
small_grades.merge(small_quiz, on = 'students', how = "left")

# if i run this command, what would happen? how many observations/record?

In [ ]:
# sql 
query = """SELECT * FROM small_grade LEFT JOIN small_quiz ON small_grade.students = small_quiz.students"""
c.execute(query).fetchall()

In [ ]:
# inner join and get the student's grades
small_grades.merge(small_quiz, on = 'students', how = 'inner')

In [ ]:
query = """SELECT grades FROM small_grade INNER JOIN small_quiz ON small_grade.students = small_quiz.students"""
c.execute(query).fetchall()

In [ ]:
# your turn - use right join and get all entries

# pandas

In [ ]:
# sql